@tnakajo : I tried to reproduce the issue. Followed the below steps with terraform-provider-ibm v1.2.5.

1. Classic cluster creation with kube_version : 4.3 open shift
```
        resource "ibm_container_cluster" "cluster" {
        name         = "test1188fra"
        datacenter   = "fra02"
        kube_version = "4.3.1_openshift"
        machine_type      = "b2c.16x64"
        hardware          = "shared"
        private_vlan_id   = "2753008"
        public_vlan_id    = "2753006"
        default_pool_size = "1"
       }
  ```

2. Add  worker pool zone attachment to existing tf configuration

```
resource "ibm_container_worker_pool_zone_attachment" "worker_zone_attachment" {
  count             = 2
  cluster           = ibm_container_cluster.cluster.name
  private_vlan_id   = "2753008"
  public_vlan_id    = "2753006"
  resource_group_id = "dae36a8eba174edd9ca57b531d50495e"
  worker_pool       = "default"
  zone              = "fra02"
}


3. Run terraform plan:
Output : 


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_container_worker_pool_zone_attachment.worker_zone_attachment[0] will be created
  + resource "ibm_container_worker_pool_zone_attachment" "worker_zone_attachment" {
      + cluster           = "test1188fra"
      + id                = (known after apply)
      + private_vlan_id   = "2753008"
      + public_vlan_id    = "2753006"
      + region            = (known after apply)
      + resource_group_id = "dae36a8eba174edd9ca57b531d50495e"
      + worker_count      = (known after apply)
      + worker_pool       = "default"
      + zone              = "fra02"
    }

  # ibm_container_worker_pool_zone_attachment.worker_zone_attachment[1] will be created
  + resource "ibm_container_worker_pool_zone_attachment" "worker_zone_attachment" {
      + cluster           = "test1188fra"
      + id                = (known after apply)
      + private_vlan_id   = "2753008"
      + public_vlan_id    = "2753006"
      + region            = (known after apply)
      + resource_group_id = "dae36a8eba174edd9ca57b531d50495e"
      + worker_count      = (known after apply)
      + worker_pool       = "default"
      + zone              = "fra02"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```

Not able to reproduce the same